# 3. Задайте список из n чисел последовательности (1+1/n)^n и выведите на экран их сумму.

# *Пример:*

# - Для n = 6: [2.0, 2.25, 2.37037037037037, 2.44140625, 2.4883199999999994, 2.5216263717421135]

num = int(input('Введите число: '))
mass = []
for i in range (1, num + 1):
    mass.append((1 + (1 / i)) ** i)
print('Cписок из n чисел последовательности (1+1/n)^n')
print(mass)
print(f'Сумма чисел -> {sum(mass)}')

num = int(input('Введите число: '))
mass = [((1 + (1 / i)) ** i)for i in range (1, num + 1)]
print(f'Сумма чисел -> {sum(mass)}')